#+title: Funktioner
#+subtitle: Programmering B
#+options: toc:nil timestamp:nil 

* Returværdier

Funktioner kan ikke kun modtage værdier, de kan også *returnere* værdier. Til dette benyttes ordet ~return~.

Et eksempel fra matematik kunne være produktet af to tal (altså gange dem sammen).

#+begin_src python -n :exports both :results output :eval never-export
def produkt_af_to_tal(tal_1, tal_2):
    resultat = tal_1 * tal_2
    return resultat

# produkt_af_to_tal(3, 4)
# print(produkt_af_to_tal(3, 4))
svar = produkt_af_to_tal(3, 4)
print(svar)
#+end_src

#+RESULTS:
#+begin_example
12
36
#+end_example

Hvis denne kode køres, sker der ikke noget. Resultatet beregnes rigtig nok, men det bliver bare smidt væk. Vi skal altså *fange* outputtet på en eller anden måde. Vi kan printe resultatet direkte, eller vi kan *gemme* outputtet i en variabel, f.eks. ~svar~, og så printe denne efterfølgende.


** Rumfang af en cylinder

Her er et eksempel, hvor returværdien fanges og bruges til at blive printet ud.
#+begin_src python -n :exports both :results output :eval never-export
from math import pi
def rumfang_cylinder(radius, hoejde):
    rumfang = pi * radius **2 * hoejde
    return rumfang

r = 2
h = 5
vol = rumfang_cylinder(r, h)
print(f"Rumfanget af en cylinder med en radius på {r} og højde på {h} er lig {vol:0.3f} m3.")

#+end_src

#+RESULTS:
#+begin_example
Rumfanget af en cylinder med en radius på 2 og højde på 5 er lig 62.832 m3.
#+end_example


Umiddelbart indtil videre er der ikke den store forskel på, om en funktion printer en værdi direkte til terminalen, eller funktionen returer værdien, og så printer man den efterfølgende. I det lange løb er der dog stor forskel på det. Fremadrettet kan det anbefales at anvende returværdier, og så printe dem senere.


Eksempel på forskellen mellem at printe direkte og så fange en returværdi og printe den efterfølgende.

#+begin_src python -n :exports both :results output :eval never-export
# Denne funktion udskriver resultatet direkte
def produkt_udskriv(tal_1, tal_2):
    resultat = tal_1 * tal_2
    print(resultat)

# Denne funktion returnerer resultatet
def produkt_retur(tal_1, tal_2):
    resultat = tal_1 * tal_2
    return resultat

# Denne kodestump udskriver produktet mellem 3 og 4
produkt_udskriv(3, 4)

# Denne kodestump udskriver ikke noget. Resultatet bliver ikke fanget
produkt_retur(3, 4)

# Nu sker der noget mærkeligt.
# Denne kodestump sætter IKKE resultatet til produktet.
# produkt_udskriv returnerer NONE
resultat = produkt_udskriv(3, 4)
print("resultat = ", resultat)

# Denne kodestump gør til gengæld det, vi regner med
produktet = produkt_retur(3, 4)
print("Produktet = ", produktet)
#+end_src

#+RESULTS:
#+begin_example
12
12
resultat =  None
Produktet =  12
#+end_example

** OPGAVE
1. Definér en funktion, som beregner og returnerer rumfanget af en kasse.
2. Definér en funktion, som beregner og returnerer overfladearealet af en kasse.

#+begin_src python :exports both :results output :eval never-export
def rumfang_kasse(l, b, h):
    rumfang = l*b*h
    return rumfang

def overfladeareal_kasse(l, b, h):
    overfladeareal = 2*(l*b + l*h + b*h)
    return overfladeareal

# Test
hoejde = 2
laengde = 3
bredde = 4

volumen = rumfang_kasse(laengde, bredde, hoejde)
areal = overfladeareal_kasse(laengde, bredde, hoejde)
print(f"For en kasse med højde = {hoejde}, bredde = {bredde} og længde = {laengde} er rumfanget = {volumen:0.3f} og overfladearealet = {areal:0.3f}.")
#+end_src

#+RESULTS:
#+begin_example
For en kasse med højde = 2, bredde = 4 og længde = 3 er rumfanget = 24.000 og overfladearealet = 52.000.
#+end_example

* Variable uden for og inden i funktioner
Her kommer der nogle meget simple eksempler på funktioner og variable.

#+begin_src python :exports both :results output :eval never-export
def f():
    x = 42

f()

print(x)
#+end_src

#+RESULTS:


Dette eksempel fejler, da ~x~ kun eksisterer inden i funktionen ~f()~.

Nu ser vi, hvad der sker, hvis ~x~ defineres uden for funktionen først.

#+begin_src python :exports both :results output :eval never-export
x = 0

def f():
    x = 42

f()
print(x)
#+end_src

#+RESULTS:
#+begin_example
0
#+end_example

Nu kan det ses, at programmet kører, men at funktionen ikke gør, som vi måske forventer. ~x~ bliver ved med at være nul.

*Don't do this at home!!*
Man kan komme omkring dette med at anvende ~globale~ variable.

#+begin_src python :exports both :results output :eval never-export
x = 0
def f():
    global x 
    x = 42

f()
print(x)
#+end_src

Dette virker, men *DON'T DO IT. JUST DON'T!!!!*


Funktioner kan godt læse variable, hvis de er skabt inden selve funktionen, og hvis funktionen /ikke ændre på den/. Det følgende eksempel virker.
#+begin_src python :exports both :results output :eval never-export
x = 27

def f():
    print(x)

f()
#+end_src

#+RESULTS:
#+begin_example
27
#+end_example

Men dette eksempel virker /ikke/, da ~x~ /ændres/ inden i funktionen.

#+begin_src python :exports both :results output :eval never-export
x = 27

def f():
    x = x + 1
    print(x)

f()
#+end_src

#+RESULTS:


* Argumentet er en kopi

Når man kalder en funktion og anvender en variabel som argument, er værdien en /kopi/ af variablens værdi. Dette kan ses i det følgende eksempel

#+begin_src python :exports both :results output :eval never-export
# En simpel funktion som lægger én til argumentet og printer svaret.
def f(x):
    x +=1 # Lægger én til argumentet
    print(f"Printer i funktionen: {x}")

# Sætter en variabel
y = 1337
# Printer oprindeligt y
print(f"Oprindeligt y = {y}")
# Kalder funktionen
f(y)
# Printer y igen, for at se, om den har ændret sig
print(f"Printer y igen: {y}")
#+end_src

#+RESULTS:
#+begin_example
Oprindeligt y = 1337
Printer i funktionen: 1338
Printer y igen: 1337
#+end_example


Her er det simpelt at se, at variable inden i en funktion kun er gældende inden for selve funktionen. Det er sværere at se i det følgende eksempel, hvor parametre til funktionen hedder det samme som argumenterne.


*Hvad forventer I, denne kodestump udskriver?*
#+begin_src python :exports both :results output :eval never-export
def f(x):
    x += 1
    print(x)

x = 1337

f(x)

print(x)
#+end_src

#+RESULTS:
#+begin_example
1338
1337
#+end_example


** Eksempel 1
#+begin_src python :exports both :results output :eval never-export
# Eksempel 1
def a():
    print("A")

def b():
    print("B")

def c():
    print("C")

a()
#+end_src

#+RESULTS:
#+begin_example
A
#+end_example

** Eksempel 5

#+begin_src python :exports both :results output :eval never-export
# Eksempel 5
def a(x):
    print("A starter, x=", x)
    b(x)
    print("A slutter, x=", x)

def b(x):
    print("B starter, x =", x)
    c(x + 1)
    print("B slutter, x =", x)


def c(x):
    print("C starter og slutter , x =", x)


a(5)
#+end_src

#+RESULTS:
#+begin_example
A starter, x= 5
B starter, x = 5
C starter og slutter , x = 6
B slutter, x = 5
A slutter, x= 5
#+end_example

